uyd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>uyd</title>
<!-- 2014-11-11 Tue 23:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Brandon Fulk" />
</head>
<body>
<div id="content">
<h1 class="title">uyd</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Archives</a>
<ul>
<li><a href="#sec-1-1">1.1. Bugs</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. <span class="done DONE">DONE</span> Episode 100 parts&#xa0;&#xa0;&#xa0;<span class="tag"><span class="playback">playback</span></span></a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Features</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. <span class="todo TODO">TODO</span> Update styling</a></li>
<li><a href="#sec-1-2-2">1.2.2. <span class="todo TODO">TODO</span> Find episode images&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rnd">rnd</span></span></a></li>
<li><a href="#sec-1-2-3">1.2.3. <span class="todo TODO">TODO</span> Search needs larger context&#xa0;&#xa0;&#xa0;<span class="tag"><span class="search">search</span></span></a></li>
<li><a href="#sec-1-2-4">1.2.4. <span class="todo TODO">TODO</span> Move from AWS to Digital Ocean&#xa0;&#xa0;&#xa0;<span class="tag"><span class="devops">devops</span></span></a></li>
<li><a href="#sec-1-2-5">1.2.5. <span class="todo TODO">TODO</span> Find older episode long descriptions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rnd">rnd</span></span></a></li>
<li><a href="#sec-1-2-6">1.2.6. <span class="todo TODO">TODO</span> Implement prev/next functionality&#xa0;&#xa0;&#xa0;<span class="tag"><span class="playback">playback</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. OkSeatbelts</a>
<ul>
<li><a href="#sec-2-1">2.1. Main Site bugs</a></li>
<li><a href="#sec-2-2">2.2. Christmas Creep</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. <span class="todo TODO">TODO</span> Email those with incomplete data</a></li>
<li><a href="#sec-2-2-2">2.2.2. <span class="todo TODO">TODO</span> Match up the peeps</a></li>
<li><a href="#sec-2-2-3">2.2.3. <span class="todo TODO">TODO</span> Send out email to participants</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Archives</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Bugs</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> <span class="done DONE">DONE</span> Episode 100 parts&#xa0;&#xa0;&#xa0;<span class="tag"><span class="playback">playback</span></span></h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Features</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> <span class="todo TODO">TODO</span> Update styling</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><ol class="org-ol"><li><a id="sec-1-2-1-1" name="sec-1-2-1-1"></a><span class="todo TODO">TODO</span> Find site styling template&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rnd">rnd</span></span><br  /></li>
<li><a id="sec-1-2-1-2" name="sec-1-2-1-2"></a><span class="todo TODO">TODO</span> Find someone to do a redesign&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rnd">rnd</span></span><br  /></li></ol>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> <span class="todo TODO">TODO</span> Find episode images&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rnd">rnd</span></span></h4>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> <span class="todo TODO">TODO</span> Search needs larger context&#xa0;&#xa0;&#xa0;<span class="tag"><span class="search">search</span></span></h4>
<div class="outline-text-4" id="text-1-2-3">
</div>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> <span class="todo TODO">TODO</span> Move from AWS to Digital Ocean&#xa0;&#xa0;&#xa0;<span class="tag"><span class="devops">devops</span></span></h4>
<div class="outline-text-4" id="text-1-2-4">
<ul class="org-ul">
<li>Will need to move the server
<ol class="org-ol">
<li>Decide on what setup
</li>
<li>Figure out provisioning and if it needs a refactor
</li>
<li>Figure out the costs pros/cons
</li>
</ol>
</li>
<li>Will need to transfer off of S3
<ol class="org-ol">
<li>Should probably use paperclip
</li>
<li>Look into using nginx streaming capabilities
</li>
<li>Look into scraping all of the current episodes as well
</li>
</ol>
</li>
</ul>
</div>
<ol class="org-ol"><li><a id="sec-1-2-4-1" name="sec-1-2-4-1"></a><span class="todo TODO">TODO</span> Think about moving to CoreOS with Docker&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rnd">rnd</span></span><br  /><ol class="org-ol"><li><a id="sec-1-2-4-1-1" name="sec-1-2-4-1-1"></a><span class="todo TODO">TODO</span> Try out CoreOS locally with Vagrant and Docker&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rnd">rnd</span></span><br  /><div class="outline-text-6" id="text-1-2-4-1-1">
<ul class="org-ul">
<li>not sure if it even makes sense to switch to CoreOS
<ul class="org-ul">
<li>seems like it's best suited to handle large clusters
</li>
</ul>
</li>
<li>might be good to use docker/dokku, though.
</li>
</ul>
</div>
</li></ol>
</li>
<li><a id="sec-1-2-4-2" name="sec-1-2-4-2"></a><span class="todo TODO">TODO</span> Try out a dokku setup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rnd">rnd</span></span><br  /><ol class="org-ol"><li><a id="sec-1-2-4-2-1" name="sec-1-2-4-2-1"></a><span class="todo TODO">TODO</span> Try out Dokku locally with Vagrant<br  /></li>
<li><a id="sec-1-2-4-2-2" name="sec-1-2-4-2-2"></a><span class="todo TODO">TODO</span> Try out multiple applications running on dokku setup<br  /></li></ol>
</li>
<li><a id="sec-1-2-4-3" name="sec-1-2-4-3"></a><span class="todo TODO">TODO</span> Move from S3 to hard drive storage&#xa0;&#xa0;&#xa0;<span class="tag"><span class="devops">devops</span></span><br  /></li></ol>
</div>
<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> <span class="todo TODO">TODO</span> Find older episode long descriptions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="rnd">rnd</span></span></h4>
</div>
<div id="outline-container-sec-1-2-6" class="outline-4">
<h4 id="sec-1-2-6"><span class="section-number-4">1.2.6</span> <span class="todo TODO">TODO</span> Implement prev/next functionality&#xa0;&#xa0;&#xa0;<span class="tag"><span class="playback">playback</span></span></h4>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> OkSeatbelts</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Main Site bugs</h3>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Christmas Creep</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> <span class="todo TODO">TODO</span> Email those with incomplete data</h4>
<div class="outline-text-4" id="text-2-2-1">
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> <span class="todo TODO">TODO</span> Match up the peeps</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> <span class="todo TODO">TODO</span> Send out email to participants</h4>
<div class="outline-text-4" id="text-2-2-3">
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Brandon Fulk</p>
<p class="date">Created: 2014-11-11 Tue 23:31</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
